idallasjlabs/agentshroud/firmware/voice-terminal/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback — auto-revert to previous slot if new firmware doesn't mark itself valid
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Octal PSRAM — required for TLS headroom + audio buffers
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
# Allocations ≤8192 bytes go to internal DRAM; larger (e.g. 16KB TLS IN buffer)
# fall through to PSRAM. Prevents mbedtls_ssl_setup OOM after WiFi+audio+AFE init.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
# Use default malloc (respects ALWAYSINTERNAL threshold) so TLS can use PSRAM.
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
# Hardware MPI (RSA bignum accelerator) — ESP32-S3 has a dedicated crypto coprocessor.
# Without this, TLS RSA handshake runs in software and can starve IDLE0 for 500ms+ per
# operation. Hardware MPI reduces that to <5ms, eliminating WDT fires during reconnect.
CONFIG_MBEDTLS_HARDWARE_MPI=y
# WDT timeout 20s (was 10, was default 5). DERP-relayed TLS handshakes can run
# close to 5s on slow relay paths. Idle-task WDT checks OFF on both cores —
# long TLS/crypto operations legitimately starve the idle tasks here.
# ⚠ These four values (WDT, idle checks, MAIN_TASK_STACK below, and the
# LWIP_TCP_* block below) were menuconfig-tuned and lived ONLY in the cached
# sdkconfig until 2026-08-28 — a clean sdkconfig regen silently reverted all
# of them, and the TCP_MSS fallback to 1440 alone broke the device's TLS
# connectivity entirely (large handshake packets blackholed on the cellular
# hotspot + Tailscale path; hours lost diagnosing it as a network issue).
# They are now pinned here so `rm sdkconfig && idf.py reconfigure` can never
# silently revert them again. Reference cache snapshot: sdkconfig-20260827-1601.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# Stack sizes — esp_timer overflow at WiFi IP acquisition with TLS in system
# ota_check has a heap-allocated 4KB buffer; main task runs TLS call frames +
# ota_check + mark-valid; 20480 is the long-standing menuconfig-tuned value
# (see WDT comment above for why it must stay pinned here).
CONFIG_ESP_TIMER_TASK_STACK_SIZE=6144
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=20480

# TCP tuned for the cellular-hotspot + Tailscale Funnel path (see WDT comment
# above — TCP_MSS=1152 is the critical one: the default 1440 gets full-size
# TLS handshake packets silently blackholed on this path and the device can
# never complete a wss:// connect; 1152 has been the working value all along).
CONFIG_LWIP_TCP_MSS=1152
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=4608
CONFIG_LWIP_TCP_WND_DEFAULT=4608

# LVGL heap capped at 32KB (default 64) — internal-RAM headroom; part of the
# same tuned-set as above.
CONFIG_LV_MEM_SIZE_KILOBYTES=32

# BOX-3 BSP board selection
CONFIG_BSP_BOARD_ESP32_S3_BOX_3=y

# CPU / power
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# BSP v3.2.0 uses i2c_new_master_bus() (driver_ng). Codec must also use new API
# to avoid the "driver_ng not allowed with old driver" conflict. Backward compat
# flag was correct for BSP v1.1.3 (old API) but breaks with BSP v3.2.0 (new API).
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n

# LVGL fonts — 14pt agent label (ui_face_set_agent), 20pt status, 28pt wifi splash
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# ── esp-sr / WakeNet ─────────────────────────────────────────────────────────
# Stock "Hi, ESP" keyword — no Espressif training required.
# Models land in the 9 MB 'model' SPIFFS partition (partitions.csv offset 0x6c4000).
CONFIG_USE_WAKENET=y
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_MODEL_IN_SPIFFS=y
# MultiNet (command-word recognition) disabled to save flash and PSRAM.
# Tried enabling it 2026-08-26 for a walkie-talkie-style "over" end-of-
# utterance command — reverted same day: it pushed the device's internal
# RAM low enough to cause repeated "esp-aes: Failed to allocate memory"
# failures inside mbedTLS during the WSS connection's TLS writes, producing
# rapid dirty-close/reconnect loops on nearly every utterance. If this gets
# revisited, budget real internal-RAM headroom first (not just PSRAM) and
# test under sustained real usage, not just a boot-time check.
CONFIG_SR_MN_EN_NONE=y

# ── mbedTLS internal-RAM headroom ───────────────────────────────────────────
# Added 2026-08-26 alongside the MultiNet revert above: MultiNet's crash
# exposed that TLS TX/RX buffers (20KB min per connection: 16KB in + 4KB out,
# CONFIG_MBEDTLS_SSL_IN/OUT_CONTENT_LEN) were sitting in scarce internal RAM
# the whole time, not PSRAM, despite CONFIG_SPIRAM_USE_MALLOC=y — PSRAM isn't
# used for these unless dynamic buffering is explicitly on. This allocates
# TX/RX buffers on demand (freed once sent/consumed) instead of holding them
# for the life of the connection, freeing real internal-RAM headroom for
# WiFi/AES/etc. Dependency (MBEDTLS_ASYMMETRIC_CONTENT_LEN) was already on by
# default. NOTE: same caveat as MultiNet above — sdkconfig.defaults alone
# won't touch an existing cached sdkconfig; also set directly in sdkconfig.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
# Tried halving CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN 16384->8192 same day to
# shrink the peak per-record allocation further — reverted within the hour:
# live testing produced MBEDTLS_ERR_SSL_BAD_INPUT_DATA (-0x7100) and
# MBEDTLS_ERR_SSL_INVALID_RECORD (-0x7200), a tight reconnect storm worse
# than the original crash. Requesting a smaller max fragment length only
# works if the far end (here: whatever terminates TLS for the Tailscale
# Funnel relay this device connects through) honors that negotiation: it
# apparently doesn't, kept sending full-size records, and the client's
# now-smaller buffer rejected them as malformed. DYNAMIC_BUFFER alone (kept)
# doesn't touch fragment-length negotiation, so it doesn't carry this risk.
# Leave SSL_IN_CONTENT_LEN at the protocol default unless the relay's TLS
# termination is confirmed to support Max Fragment Length negotiation.
# Disabled 2026-08-27: dynamic buffering alone didn't fully eliminate the
# esp-aes allocation failures — they recurred, roughly every ~30s of active
# use, consistent with fragmentation accumulating across repeated reconnects
# rather than a one-time deficit. Each reconnect does a full fresh TLS
# handshake; KEEP_PEER_CERTIFICATE holds ~4KB of peer cert data per
# connection afterward (ESP-IDF's own Kconfig help text states this exact
# figure) for a use case this firmware doesn't have — confirmed via grep,
# nothing in firmware/voice-terminal/main ever calls the peer-cert
# inspection API. Freeing that 4KB doesn't cost anything functionally; it's
# real headroom recovered on every single connection, not just a one-time
# saving, which matters most exactly when reconnects are frequent.
# CONFIG_MBEDTLS_SSL_KEEP_PEER_CERTIFICATE is not set

# WiFi credentials (SSID pre-set; set password via: idf.py menuconfig → Voice Terminal Config)
# Voice Gateway WS URL — marvin LAN (Phase 1; switch to wss://... for Tailscale Phase 2)
CONFIG_VT_VG_WS_URL="wss://marvin.tail240ea8.ts.net/voice"

CONFIG_VT_WIFI_SSID="ford-prefect"
CONFIG_VT_WIFI_PASSWORD=""
